import fs from 'fs'
import fetch from 'node-fetch'
import { xpRange } from '../lib/levelling.js'
const { levelling } = '../lib/levelling.js'
import PhoneNumber from 'awesome-phonenumber'
import { promises } from 'fs'
import { join } from 'path'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
try {
let vn = './media/menu.mp3'
let pp = imagen4
let img = await(await fetch('https://telegra.ph/file/d7ae77d1178f9de50825c.jpg')).buffer()
let d = new Date(new Date + 3600000)
let locale = 'ar'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let user = global.db.data.users[m.sender]
let { money, joincount } = global.db.data.users[m.sender]
let { exp, limit, level, role } = global.db.data.users[m.sender]
let { min, xp, max } = xpRange(level, global.multiplier)
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let str = `
●▬▬▬ஜƸ̵̡⁠Ӝ̵̨̄⁠Ʒஜ▬▬▬●
*❘╼╼𓏪 قائـمـة 📜 الاوامـر 𓏪╾╾❘*
── • ◈ • ──
*🎶✬⃝┇اهلا👋* ${taguser}
*🎶✬⃝┇أنـا اسـمـــي "مـيــكـو"*
*🎶✬⃝┇الـمطـــور* "ᎯᎽᎯᏁᎯᏦᏫᎫᎥ"
*🎶✬⃝┇*وقـــت الـعــمـل* ${uptime}
*🎶✬⃝┇لـاتـنـســی قـبــل كــل امــر ﹙.﹚*
*🎶✬⃝┇هــا لــك أوامـــر الـبــوت ☟*
*🎶✬⃝┇.صلح
⏎* *لو البوت مش ظاهر عندك يصلح تشفير* 


*〄━━┋ ★الـأوامــر★ ┋━━〄*

*❁ اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَامُحَمد ﷺ ❁*

 *˼‏💠˹ قـسـم الـمـجـمـوعـات╿↶*
━ ── • ⟐ • ── ━
*✎╎📛 ⇠〘 .منشن 〙*    
*⏎* يمنشن جماعي لكل الاعضاء
*✎╎👤 ⇠〘 .مخفي 〙*    
*⏎* منشن وهمي
*✎╎🏷️ ⇠〘 .الجروب 〙*    
*⏎* يجيبلك معلومات الجروب كامله
*✎╎🧾 ⇠〘 .المشرفين 〙*    
*⏎* يجيبلك قائمة المشرفين
*✎╎👻 ⇠〘 .الاشباح 〙*    
*⏎* يجيبلك الاعضاء اللي ما بتتفاعل
*✎╎🔄 ⇠〘 .رستر 〙*    
*⏎* يرستر او يعمل اعادة تعيين للينك الجروب
━ ── • ⟐ • ── ━
*˼‏🕌˹ قـسـم الدين╿↶*
━ ── • ⟐ • ── ━
*✎╎🌅 ⇠〘اذكار الصباح〙*    
*⏎* يجيبلك اذكار الصباح
*✎╎🌉 ⇠〘اذكار المساء〙*    
*⏎* يجيبلك اذكار المساء
*✎╎📕 ⇠〘قران〙*    
*⏎* يجيبلك ايه من قرأن كريم
*✎╎🗣️ ⇠〘 .حديث 〙*    
*⏎* البوت يرسل احاديث
*✎╎🕋 ⇠〘 .ايه 〙*    
*⏎* اكتب رقم سوره وبعدها رقم الايه بس بصوت شيخ مختلف
━ ── • ⟐ • ── ━
*˼‏🔃˹ قـسـم التحويلات╿↶*
━ ── • ⟐ • ── ━
*✎╎🎴 ⇠〘 .ملصق 〙*    
*⏎* تحويل الصورة لملصق
*✎╎©️ ⇠〘 .سرقه 〙*    
*⏎* سرقة ملصق بحقوقك
*✎╎♻️ ⇠〘 .لصوره 〙*    
*⏎* تحويل الملصق لصورة
*✎╎🎞️ ⇠〘 .لفديو 〙*    
*⏎* تحويل الملصق المتحرك لفيديو
*✎╎📩 ⇠〘 .تليجراف 〙*    
*⏎* رفع الصور و الفديوهات الى تليجراف
*✎╎🐼 ⇠〘 .لكرتون 〙*    
*⏎* يحول صورك لكرتون مع تحويل الوجه لاستيكر
*✎╎🏮 ⇠〘 .لانمي 〙*    
*⏎* تحويل صورك لانمي بالذكاء الاصطناعي
*✎╎🎙️ ⇠〘 .انطق 〙*    
*⏎* تحويل النص الى كلام
━ ── • ⟐ • ── ━
 *˼‏🔃˹ قـسـم الـتحميلات╿↶*
━ ── • ⟐ • ── ━
*✎╎🎦 ⇠〘 .تيك 〙*    
*⏎* ينزل فيديو من التيك توك بدون علامة مائية
*✎╎🎞️ ⇠〘 .فيديو 〙*    
*⏎* يحمل اي فيديو يوتيوب
*✎╎🎥⇠〘 .فديو 〙*
لتيحمل اي فيديوهات يوتيوب ب استخدام لينك
*✎╎🍥 ⇠〘 .انستا 〙*    
*⏎*يحملك فيديوهات من الانستا
✎╎ 💠⇠〘 .فيس 〙*    
⏎* يحملك اي فيديو من الفيس
*✎╎🎶 ⇠〘 .اغنيه 〙*    
*⏎*يحملك اي اغنيه من يوتيوب
*✎╎⬇️ ⇠〘 .تطبيق  〙*    
*⏎*يحمل برامج APK
*✎╎🖼️ ⇠〘 .صور 〙*    
*⏎*يحمل صور من تيك توك عن طريق لنك 
━ ── • ⟐ • ── ━
 *˼‏🤖˹ قـسـم الـذكاء الاصطناعي╿↶*
━ ── • ⟐ • ── ━
*✎╎🤖 ⇠〘 .ميكو 〙*    
*⏎*  اسأل البوت اي سؤال
*✎╎👾 ⇠〘 .ايانو 〙*    
*⏎* ذكاء اصطناعي جانبي أسأله اي سؤال
*✎╎🐦 ⇠〘 .كيمو 〙*    
*⏎*ذكاء اصطناعي يتكلم بلمصريه احذر سبه اللهم بلغت مصريه
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب1 سؤال وإجابه╿↶*
━ ── • ⟐ • ── ━
 *✎╎☪️⇠〘.دين〙*    
*⏎* يسألك اسأله دينيه
*✎╎🔢 ⇠〘 .الرياضيات 〙*    
*⏎* يرسل لك اسألة رياضيات ب مستويات
*✎╎⚽ ⇠〘 .رياضه 〙*    
*⏎*يسألك اسأله عن كرة القدم
*✎╎🖋️⇠〘 .كت 〙*    
*⏎* لعبة كتابة للتسلية
*✎╎🏷️⇠〘 .فكك 〙*    
*⏎* يجيبلك كلمة تفككها
*✎╎🗂️ ⇠〘 .رتب 〙*    
*⏎* يجيبلك احرف مبعثرة وانت ترتبها
*✎╎🗝️ ⇠〘 .خمن 〙*    
*⏎* يوصفلك شخصية انمي وانت تحاول تخمنها
*✎╎🎭 ⇠〘 .ايموجي 〙*    
*⏎* احزر الشخصيه من الايموجي
*✎╎🗝️ ⇠〘 .انمي 〙*    
*⏎* يسألك اسألة انمي
*✎╎📷 ⇠〘 .عين 〙*    
*⏎* صور عيون لشخصيات انمي للتسليه
*✎╎🎭 ⇠〘 .احزر 〙*    
*⏎* البوت يرسل صور انمي للتسلية
*✎╎🌎 ⇠〘 .علم 〙*    
*⏎* احزر صورة العلم
*✎╎ ⇠〘 .كوره 〙*    
⏎* يجبلك صورة لاعب كوره وانت تجاوب
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب2 العاب متطوره╿↶*
━ ── • ⟐ • ── ━
*✎╎🎲 ⇠〘 .نرد〙*    
*⏎*  يرسل نرد عشوائي
*✎╎🧞‍♂️ ⇠〘 .المارد 〙*    
*⏎* لعبة المارد الأزرق للتسليه
*✎╎🔰⇠〘 .تحدي 〙*    
*⏎* لعبة حجر ورقة مقص
*✎╎🎮 ⇠〘 .اكس او 〙*    
*⏎* لعبة اكس او
*✎╎🎰⇠〘.رهان〙*    
*⏎*  راهن ب رقم من نقاتك لو خسرت بتخسرها
*✎╎♟️ ⇠〘 .شطرنج〙*    
*⏎*  للعب لعبة الشطنرج
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب3 كتابه واسأله╿↶*
━ ── • ⟐ • ── ━
*✎╎❓ ⇠〘 .سؤال 〙*    
*⏎* اسئلة عشوائية للتسلية مع الاصدقاء
*✎╎📋 ⇠〘 .لو 〙*    
*⏎*لعبة لو خيروك للتسلية مع الاصدقاء
*✎╎🎫 ⇠〘 .تاج 〙*    
*⏎* البوت يقترحلك رقم منشن وانت تنمشنه
*✎╎🧩 ⇠〘 .فزوره 〙*    
*⏎* اسئلة فوازير للتسلية
*✎╎✅ ⇠〘 .صراحه 〙*    
*⏎* اسئلة وتجاوب عليها بصراحة
*✎╎🧩 ⇠〘 .حروف 〙*    
*⏎* يجيبلك حروف ل اسماء عشوائيه
*✎╎📢 ⇠〘 .مقوله 〙*    
*⏎* يجيبلك مقولات انمي
*✎╎🍀 ⇠〘 .نصيحه 〙*    
*⏎* البوت ينصحك نصيحة
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب4 العاب المنشن ╿↶*
━ ── • ⟐ • ── ━
*✎╎🔝 ⇠〘 .توب 〙*    
*⏎* يجيبك لك افضل 10 في القروب
*✎╎🧑‍🤝‍🧑 ⇠〘 .صداقه 〙*    
*⏎* يصادق اثنين عشوائي من الجروب 
*✎╎💍 ⇠〘 .زواج 〙*    
*⏎* بزوج اثنين عشوائي من الجروب
*✎╎💔 ⇠〘 .طلاق 〙*    
*⏎* يطلق اثنين عشوائي من الجروب
✎╎ 👬🏼⇠〘 .رفيق 〙*    
⏎* يجيب توأمك الروحي
━ ── • ⟐ • ── ━
*˼‏🏛️˹ قـسـم البنك╿↶*
━ ── • ⟐ • ── ━
*✎╎📊 ⇠〘 .رانك 〙*    
*⏎* لمعرفة عدد مستواك ونقاتك في الفعاليات والماسك وبياناتك كلما تفاعلت مع البوت وتربح فعاليات وتتفاعل يرفع مستواك في تصنيفات
*✎╎🏦 ⇠〘 .البنك 〙*    
*⏎* يجيبلك حساب نقات فعاليات البوت
*✎╎🏦 ⇠〘 .لفل 〙*    
*⏎* يجيبلك نقاتك وعدد الماسك ورتبتك
*✎╎💰⇠〘.شراء〙*    
*⏎*  اذا اردت شراء لماس واكتب الكميه مثال .شراء 1
*✎╎🎁 ⇠〘 .يومي 〙*    
*⏎*  يعطيك هديه يوميه
*✎╎💱 ⇠〘 .تحويل 〙*    
*⏎*  لتحويل نقاتك الي شخص اخر
*✎╎📈 ⇠〘 .تصنيف 〙*    
*⏎*  يجيب اكثر اشخاص ربحو نقاط من البوت
━ ── • ⟐ • ── ━
*˼‏🖼️˹ قـسـم الصور والايدت╿↶*
━ ── • ⟐ • ── ━
*✎╎💕 ⇠〘 .ميكي 〙*    
*⏎* يجيبلك ايدت ل ميكو 
*✎╎🖼️ ⇠〘 .خلفيه 〙*    
*⏎* يرسل خلفيات انمي
*✎╎🐧 ⇠〘 .ميمز 〙*    
*⏎* يرسل ميمز انمي
*✎╎👩‍❤️‍👨 ⇠〘 .طقم 〙*    
*⏎* يجيبلك طقم ولاد و بنات
*✎╎🧒 ⇠〘 .طقم2 〙*    
*⏎* يجيبلك صور اولاد 
*✎╎👧🏻 ⇠〘 .طقمي 〙*    
*⏎* يجيبلك طقم بنات
*✎╎🐈‍⬛ ⇠〘 .قط 〙*    
*⏎* صور لقطط عشوائية
*✎╎📹 ⇠〘 .ايدت 〙*    
*⏎* البوت يرسل ايدت انمي
━ ── • ⟐ • ── ━
*˼‏👥˹ قـسـم الاعـضــاء╿↶*
━ ── • ⟐ • ── ━
*✎╎❔ ⇠〘 .هل 〙*    
*⏎* أسأل ميكو اي سؤال ب هل
*✎╎🍡 ⇠〘 .انيمي 〙*    
*⏎* اكتب اسم انمي يجيلك
*✎╎📊⇠〘 .نسبه 〙*    
*⏎* يقيس لك نسبتك في الجروب
✎╎ 💞⬇️⇠〘 .حب 〙*    
⏎* منشن شخص يقيص نسبت حبكم
*✎╎🖼️ ⇠〘 .بروفايل 〙*    
*⏎*  يجبلك بياناتك
*✎╎👤 ⇠〘 .شخصيه 〙*    
*⏎*   يجيب نسبة شخصيتك
*✎╎💫 ⇠〘 .زخرفه 〙*    
*⏎* زخرفة الكلمات للاسف انجليزي بس
*✎╎🔰 ⇠〘 .دمج 〙*    
*⏎* دمج الايموجي وتكوين ستيكر
*✎╎💭 ⇠〘 .تصميم 〙*    
*⏎* الحصول على تصميم من البوت
*✎╎🔍 ⇠〘 .بحث 〙*    
*⏎* البحث في غوغل
*✎╎👨🏻‍💻 ⇠〘 .المطور 〙*    
*⏎* يجيبلك رقم مطور البوت
*✎╎📌⇠〘.مساعدين〙*    
*⏎* يظهر لك مساعدين المطور
*✎╎🚨 ⇠〘 .الدعم 〙*    
*⏎*  إذا لديك  مشكله في البوت كلم الدعم
*✎╎🎤 ⇠〘 .انطقي 〙*    
*⏎* ينطق صوت بلياباني
*✎╎🎙️ ⇠〘 .انطق 〙*    
*⏎* ينطق صوت عربي او انجليزي
━ ── • ⟐ • ── ━
*˼‏🖥️˹ قـسـم المطور╿↶*
━ ── • ⟐ • ── ━
*✎╎👑 ⇠〘 .بريم 〙*    
*⏎* يمكن للمطور فقط اعطاء صلاحيات لاستخدام البوت
*✎╎🚫 ⇠〘 .حظر 〙*    
*⏎* حظر الشات للبوت
*✎╎⭕ ⇠〘 .الغاء-الحظر 〙*    
*⏎* الغاء حظر الشات للبوت
*✎╎🔐 ⇠〘 .المحظورين 〙*    
*⏎*يجيبلك الارقام والشاتات المحظورة
*✎╎🌟 ⇠〘 .المميزين 〙*    
*⏎* الاشخاص البيرميوم
*✎╎⛔ ⇠〘 .بلوك 〙*    
*⏎* تخلي البوت يعمل لشخص بلوك
*✎╎✅ ⇠〘 .رفع-بلوك 〙*    
*⏎* يرفع البلوك عن المستخدم
*✎╎🚷 ⇠〘 .البلوكات 〙*    
*⏎* الأشخاص الواخدين بلوك من البوت
*✎╎⚠️ ⇠〘 .بان 〙*    
*⏎* حظر شخص من استخدام البوت
*✎╎🔓 ⇠〘 .رفع-بان 〙*    
*⏎* يرفع البان عن المستخدم
✎╎ 🌐⇠〘 .تهكير 〙*    
⏎* امر خاص للمطور
*✎╎🔛 ⇠〘 .انضم 〙*    
*⏎* البوت ينضم لجروبات عن طريق الرابط
*✎╎🔚 ⇠〘 .اخرج 〙*    
*⏎* البوت يخرج من الجروبات
*✎╎🚨 ⇠〘 .مهم 〙*    
*⏎* يعمل منشن خفي للمطور فقط 
*✎╎🎌 ⇠〘 .اعلان 〙*    
*⏎* يعلن المطور عن تحديثات البوت 
━ ── • ⟐ • ── ━
*˼‏ ⚠️˹ مـلاحــظــة╿↶*
╭ ⋅ ⋅ ── ⋅ ⋅ ── ✩ ── ⋅ ⋅ ── ⋅ ⋅ ╮
*❶ - يمنع منعا بتا سب البوت.*
*❷ - استخدام البوت بشكل متوازن و بدون تسبب ازعاج للاعضاء.*
 ╰⋅ ⋅ ── ⋅ ⋅ ── ✩ ── ⋅ ⋅ ── ⋅ ⋅ ╯

*~.¸¸ ❝ 𝕸𝖎𝖐𝖚 𝕭𝖔𝖙 ❝ ¸¸.~*

`.trim()
let buttonMessage = {
image: pp,
caption: str.trim(),
mentions: [m.sender],
footer: `${wm}`,
headerType: 4,
contextInfo: {
mentionedJid: [m.sender],
externalAdReply: {
showAdAttribution: true,
mediaType: 'VIDEO',
mediaUrl: null,
title: '『👑┇miku┇🤖┇Bot┇👑』',
body: null,
thumbnail: img,
sourceUrl: `https://telegra.ph/file/cafd9e7934fd98f2dc7a8.jpg`
}}}
conn.sendMessage(m.chat, buttonMessage, { quoted: m })
//await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
} catch {
conn.reply(m.chat, '[❗𝐈𝐍𝐅𝐎❗] 𝙴𝙻 𝙼𝙴𝙽𝚄 𝚃𝙸𝙴𝙽𝙴 𝚄𝙽 𝙴𝚁𝚁𝙾𝚁 𝚈 𝙽𝙾 𝙵𝚄𝙴 𝙿𝙾𝚂𝙸𝙱𝙻𝙴 𝙴𝙽𝚅𝙸𝙰𝚁𝙻𝙾, 𝚁𝙴𝙿𝙾𝚁𝚃𝙴𝙻𝙾 𝙰𝙻 𝙿𝚁𝙾𝙿𝙸𝙴𝚃𝙰𝚁𝙸𝙾 𝙳𝙴𝙻 𝙱𝙾𝚃', m)
}}
handler.command = /^(اوامر-شرح|شرح|الشرح|اشرح)$/i
handler.exp = 50
handler.fail = null
export default handler
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}