let handler = async (m, { conn }) => {
m.reply(global.terminos)}
handler.customPrefix = /الاستخدام|الدعم|الخصوصية|الخصوصيه ولا الاستخدام|شروط الخصوصية|شروط الخصوصيه|شروط الاستخدام/i
handler.command = new RegExp
export default handler

global.terminos = `

┗═──═⊱⬩⊰🎩⊱⬩⊰═──═┛
• *تم تطويري وبرمجتي* •⊱
• *بواسطة اياناكوجي* •
  
 *تابعني علي صفحاتي من هنا*  :
https://atom.bio/ayanakoji

*رقم المطور اذا واجهتك مشكله في البوت*:
https://wa.me/201020260148
*تابعني علي قناتي في واتساب لتعرف تحديثات المطور للبوت*
https://whatsapp.com/channel/0029Va9FiAVIHph93nL9hw2K

┗═──═⊱⬩⊰🎩⊱⬩⊰═──═┛

 *❤️‍🔥~°ᎯᎽᎯᏁᎯᏦᏫᎫᎥ!°~⛩️📛`
